In [1]:
import sqlite3

In [2]:
from sqlite3 import Error

In [14]:
import pandas as pd

In [9]:
#Creating a new db using python

def create_connection(db_file):
    """create db connection to SQLite Db"""
    conn = None
    try:
        conn = sqlite3.connect(db_file)
    except Error as e:
        print(e)
    finally:
        if conn:
            conn.close()

In [10]:
# if __name__=='__main__':
#     create_connection(r"C:\Users\19035\Documents\Data Science - Flatiron\Practice\Current\Coding_Practice\SQL\pythonsqlite.db")

In [8]:
create_connection(r"C:\Users\19035\Documents\Data Science - Flatiron\Practice\Current\Coding_Practice\SQL\pythonsqlite.db")

In [11]:
conn = sqlite3.connect('pythonsqlite.db')

In [12]:
cur=conn.cursor()

 #### Creating a grocery list : Bananas (4), Peanut Butter (1), Dark Chocolate bars (2)

In [19]:
#create table
cur.execute("""CREATE TABLE groceries (id INTEGER PRIMARY KEY, name TEXT, quantity INTEGER);""")

In [20]:
pd.DataFrame(cur.execute("""SELECT * FROM groceries;""").fetchall())

Empty DataFrame
Columns: []
Index: []

In [21]:
cur.description

(('id', None, None, None, None, None, None),
 ('name', None, None, None, None, None, None),
 ('quantity', None, None, None, None, None, None))

In [22]:
def sql_to_pd(query):
    df = pd.DataFrame(cur.execute(query).fetchall())
    df.columns = [x[0] for x in cur.description]
    return df

In [23]:
cur.execute("""INSERT INTO groceries VALUES (1,"Bananas", 4);""")

In [24]:
sql_to_pd("""SELECT * FROM groceries;""")

   id     name  quantity
0   1  Bananas         4

In [25]:
cur.execute("""INSERT INTO groceries VALUES (2, "Peanut Butter", 1);""")
cur.execute("""INSERT INTO groceries VALUES (3, "Dark Chocolate Bars", 2);""")

In [26]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity
0   1              Bananas         4
1   2        Peanut Butter         1
2   3  Dark Chocolate Bars         2

#### Add column

In [27]:
cur.execute("""ALTER TABLE groceries
                ADD aisle INTEGER;""")

In [28]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity aisle
0   1              Bananas         4  None
1   2        Peanut Butter         1  None
2   3  Dark Chocolate Bars         2  None

In [29]:
cur.execute("""INSERT INTO groceries(aisle)
                VALUES (7)""")

cur.execute("""INSERT INTO groceries(aisle)
                VALUES (2)""")

cur.execute("""INSERT INTO groceries(aisle)
                VALUES (2)""")

In [30]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity  aisle
0   1              Bananas       4.0    NaN
1   2        Peanut Butter       1.0    NaN
2   3  Dark Chocolate Bars       2.0    NaN
3   4                 None       NaN    7.0
4   5                 None       NaN    2.0
5   6                 None       NaN    2.0

#### Delete rows

In [31]:
cur.execute("""DELETE FROM groceries WHERE id=4;""")
cur.execute("""DELETE FROM groceries WHERE id=5;""")
cur.execute("""DELETE FROM groceries WHERE id=6;""")

In [32]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity aisle
0   1              Bananas         4  None
1   2        Peanut Butter         1  None
2   3  Dark Chocolate Bars         2  None

#### Update Value

In [35]:
cur.execute("""UPDATE groceries
                SET aisle = 7
                WHERE id = 1;""")
cur.execute("""UPDATE groceries
                SET aisle = 2
                WHERE id = 2;""")
cur.execute("""UPDATE groceries
                SET aisle = 2
                WHERE id = 3;""")

In [36]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity  aisle
0   1              Bananas         4      7
1   2        Peanut Butter         1      2
2   3  Dark Chocolate Bars         2      2

In [38]:
cur.execute("""INSERT INTO groceries VALUES (4, "Ice Cream", 1, 12);""")
cur.execute("""INSERT INTO groceries VALUES (5, "Cherries", 6, 2);""")
cur.execute("""INSERT INTO groceries VALUES (6, "Chocolate Syrup", 1, 4);""")

In [39]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity  aisle
0   1              Bananas         4      7
1   2        Peanut Butter         1      2
2   3  Dark Chocolate Bars         2      2
3   4            Ice Cream         1     12
4   5             Cherries         6      2
5   6      Chocolate Syrup         1      4

In [41]:
sql_to_pd("""SELECT * FROM groceries ORDER BY aisle;""")

   id                 name  quantity  aisle
0   2        Peanut Butter         1      2
1   3  Dark Chocolate Bars         2      2
2   5             Cherries         6      2
3   6      Chocolate Syrup         1      4
4   1              Bananas         4      7
5   4            Ice Cream         1     12

In [42]:
sql_to_pd("""SELECT * FROM groceries WHERE aisle>5 ORDER BY aisle;""")

   id       name  quantity  aisle
0   1    Bananas         4      7
1   4  Ice Cream         1     12

#### Aggregating Data

In [43]:
cur.execute("""SELECT SUM(quantity) FROM groceries;""").fetchall()

[(15,)]

In [44]:
sql_to_pd("""SELECT SUM(quantity) FROM groceries;""")

   SUM(quantity)
0             15

In [45]:
sql_to_pd("""SELECT MAX(quantity) FROM groceries;""")

   MAX(quantity)
0              6

In [47]:
sql_to_pd("""SELECT name, MAX(quantity) FROM groceries;""")

       name  MAX(quantity)
0  Cherries              6

In [48]:
sql_to_pd("""SELECT SUM(quantity) FROM groceries GROUP BY aisle;""")

   SUM(quantity)
0              9
1              1
2              4
3              1

In [50]:
sql_to_pd("""SELECT aisle, SUM(quantity) FROM groceries GROUP BY aisle;""")

   aisle  SUM(quantity)
0      2              9
1      4              1
2      7              4
3     12              1

### More Complex Queries